MongoDB/Workload A/Output_Test2_LOAD.txt
java -cp /home/ubuntu/ycsb-0.17.0/mongodb-binding/conf:/home/ubuntu/ycsb-0.17.0/conf:/home/ubuntu/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/home/ubuntu/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/home/ubuntu/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/home/ubuntu/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/home/ubuntu/ycsb-0.17.0/lib/core-0.17.0.jar:/home/ubuntu/ycsb-0.17.0/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar:/home/ubuntu/ycsb-0.17.0/mongodb-binding/lib/mongo-java-driver-3.8.0.jar:/home/ubuntu/ycsb-0.17.0/mongodb-binding/lib/slf4j-api-1.7.25.jar:/home/ubuntu/ycsb-0.17.0/mongodb-binding/lib/snappy-java-1.1.7.1.jar:/home/ubuntu/ycsb-0.17.0/mongodb-binding/lib/mongodb-binding-0.17.0.jar:/home/ubuntu/ycsb-0.17.0/mongodb-binding/lib/logback-classic-1.1.2.jar:/home/ubuntu/ycsb-0.17.0/mongodb-binding/lib/logback-core-1.1.2.jar site.ycsb.Client -db site.ycsb.db.MongoDbClient -s -P workloads/workloada -p recordcount=1000 -p mongodb.upsert=true -p mongodb.url=mongodb://primary:27017,secondary1:27017,secondary2:27017,secondary3:27017/?replicaSet=myReplicaSet -load
Command line: -db site.ycsb.db.MongoDbClient -s -P workloads/workloada -p recordcount=1000 -p mongodb.upsert=true -p mongodb.url=mongodb://primary:27017,secondary1:27017,secondary2:27017,secondary3:27017/?replicaSet=myReplicaSet -load
YCSB Client 0.17.0

Loading workload...
Starting test.
2023-04-09 20:15:23:686 0 sec: 0 operations; est completion in 0 second
mongo client connection created with mongodb://primary:27017,secondary1:27017,secondary2:27017,secondary3:27017/?replicaSet=myReplicaSet
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2023-04-09 20:15:31:027 7 sec: 1000 operations; 135.04 current ops/sec; [CLEANUP: Count=1, Max=5103, Min=5100, Avg=5102, 90=5103, 99=5103, 99.9=5103, 99.99=5103] [INSERT: Count=1000, Max=131967, Min=3362, Avg=6674.13, 90=9295, 99=15919, 99.9=21535, 99.99=131967]
[OVERALL], RunTime(ms), 7407
[OVERALL], Throughput(ops/sec), 135.00742540839747
[TOTAL_GCS_G1_Young_Generation], Count, 4
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 39
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.5265289590927501
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 4
[TOTAL_GC_TIME], Time(ms), 39
[TOTAL_GC_TIME_%], Time(%), 0.5265289590927501
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 5102.0
[CLEANUP], MinLatency(us), 5100
[CLEANUP], MaxLatency(us), 5103
[CLEANUP], 95thPercentileLatency(us), 5103
[CLEANUP], 99thPercentileLatency(us), 5103
[INSERT], Operations, 1000
[INSERT], AverageLatency(us), 6674.128
[INSERT], MinLatency(us), 3362
[INSERT], MaxLatency(us), 131967
[INSERT], 95thPercentileLatency(us), 10943
[INSERT], 99thPercentileLatency(us), 15919
[INSERT], Return=OK, 1000