MongoDB/Workload A/Output_Test3_LOAD.txt
java -cp /home/ubuntu/ycsb-0.17.0/mongodb-binding/conf:/home/ubuntu/ycsb-0.17.0/conf:/home/ubuntu/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/home/ubuntu/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/home/ubuntu/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/home/ubuntu/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/home/ubuntu/ycsb-0.17.0/lib/core-0.17.0.jar:/home/ubuntu/ycsb-0.17.0/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar:/home/ubuntu/ycsb-0.17.0/mongodb-binding/lib/mongo-java-driver-3.8.0.jar:/home/ubuntu/ycsb-0.17.0/mongodb-binding/lib/slf4j-api-1.7.25.jar:/home/ubuntu/ycsb-0.17.0/mongodb-binding/lib/snappy-java-1.1.7.1.jar:/home/ubuntu/ycsb-0.17.0/mongodb-binding/lib/mongodb-binding-0.17.0.jar:/home/ubuntu/ycsb-0.17.0/mongodb-binding/lib/logback-classic-1.1.2.jar:/home/ubuntu/ycsb-0.17.0/mongodb-binding/lib/logback-core-1.1.2.jar site.ycsb.Client -db site.ycsb.db.MongoDbClient -s -P workloads/workloada -p recordcount=1000 -p mongodb.upsert=true -p mongodb.url=mongodb://primary:27017,secondary1:27017,secondary2:27017,secondary3:27017/?replicaSet=myReplicaSet -load
Command line: -db site.ycsb.db.MongoDbClient -s -P workloads/workloada -p recordcount=1000 -p mongodb.upsert=true -p mongodb.url=mongodb://primary:27017,secondary1:27017,secondary2:27017,secondary3:27017/?replicaSet=myReplicaSet -load
YCSB Client 0.17.0

Loading workload...
Starting test.
2023-04-09 20:25:45:047 0 sec: 0 operations; est completion in 0 second
mongo client connection created with mongodb://primary:27017,secondary1:27017,secondary2:27017,secondary3:27017/?replicaSet=myReplicaSet
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2023-04-09 20:25:52:750 7 sec: 1000 operations; 128.49 current ops/sec; [CLEANUP: Count=1, Max=4479, Min=4476, Avg=4478, 90=4479, 99=4479, 99.9=4479, 99.99=4479] [INSERT: Count=1000, Max=113279, Min=3536, Avg=7039.35, 90=9015, 99=17663, 99.9=24495, 99.99=113279]
[OVERALL], RunTime(ms), 7783
[OVERALL], Throughput(ops/sec), 128.48515996402415
[TOTAL_GCS_G1_Young_Generation], Count, 4
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 33
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.42400102788127975
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 4
[TOTAL_GC_TIME], Time(ms), 33
[TOTAL_GC_TIME_%], Time(%), 0.42400102788127975
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 4478.0
[CLEANUP], MinLatency(us), 4476
[CLEANUP], MaxLatency(us), 4479
[CLEANUP], 95thPercentileLatency(us), 4479
[CLEANUP], 99thPercentileLatency(us), 4479
[INSERT], Operations, 1000
[INSERT], AverageLatency(us), 7039.35
[INSERT], MinLatency(us), 3536
[INSERT], MaxLatency(us), 113279
[INSERT], 95thPercentileLatency(us), 11143
[INSERT], 99thPercentileLatency(us), 17663
[INSERT], Return=OK, 1000